> (enter! "demo.rkt")

*****************************************************
*                    Racket 2023                    *
* Demo de definicion y uso de variables y funciones *
*****************************************************

Definicion de variables
-----------------------
> (define u 'u)
> (define v 'v)
> (define w 'w)

Las variables ahora estan en el ambiente.
Evaluandolas se obtienen sus valores:
> u
(quote u)
> v
(quote v)
> w
(quote w)

Una vez definida una variable, con set! se le puede
cambiar el valor:
> (define n 0)
> n
0
> (set! n 17)
> n
17

Definicion de funciones
-----------------------
> (define (sumar a b) (+ a b))
> (define (restar a b) (- a b))

Las funciones ahora estan en el ambiente.
es posible aplicarlas a valores formando expresiones
que evaluadas generan resultados:
> (sumar 3 5)
8
> (restar 12 5)
7

Racket es un lenguaje de ambito lexico (lexically scoped):
> (define x 1)
> (define (g y) (+ x y))
> (define (f x) (g 2))
> (f 5)
3
[En TLC-Lisp -dynamically scoped- daria 7 en lugar de 3]

Aplicacion de funciones anonimas [lambdas]
------------------------------------------

Lambda con cuerpo simple:
> ((lambda (y) (+ 1 y)) 15)
16

Lambda con cuerpo multiple:
> ((lambda (y) (display "hola!") (newline) (+ 1 y)) 5)
hola!
6

Lambda con cuerpo multiple y efectos colaterales [side effects]:
> ((lambda (a b c) (set! u a) (set! v b) (set! w c)) 1 2 3)
#<void>

Los nuevos valores de las variables modificadas:
> u
1
> v
2
> w
3

Aplicacion parcial:
> (((lambda (x) (lambda (y) (- x y))) 8) 3)
5

El mismo ejemplo anterior, ahora definiendo una funcion:
> (define p (lambda (x) (lambda (y) (- x y))))
> (p 8)
(lambda (y) (- 8 y))
> ((p 8) 3)
5

Definicion de funciones recursivas [recorrido lineal]
-----------------------------------------------------

Funcion recursiva con efecto colateral
[deja en la variable d la cantidad de pares]:
> (define (recorrer l)
    (recorrer2 l 0))
> (define d 0)
> (define (recorrer2 l i)
    (cond
      ((null? (cdr l)) (set! d (+ 1 d)) (list (car l) i))
      (%t (display (list (car l) i)) (set! d (+ i 1)) (newline) (recorrer2 (cdr l) d))))
> (recorrer '(a b c d e f))
(a 0)
(b 1)
(c 2)
(d 3)
(e 4)
(f 5)
> d
6

Definicion de funciones recursivas [recorrido "a todo nivel"]
-------------------------------------------------------------

Existencia de un elemento escalar en una lista:
> (define (existe? a l)
    (cond
      ((null? l) %f)
      ((not (list? (car l))) (or (equal? a (car l)) (existe? a (cdr l))))
      (else (or (existe? a (car l)) (existe? a (cdr l))))))
> (existe? 'c '(a ((b) ((d c) a) e f)))
#t
> (existe? 'g '(a ((b) ((d c) a) e f)))
#f

Eliminacion de un elemento de una lista:
> (define (eliminar dat li)
    (cond
      ((null? li) li)
      ((equal? dat (car li)) (eliminar dat (cdr li)))
      ((list? (car li)) (cons (eliminar dat (car li)) (eliminar dat (cdr li))))
      (else (cons (car li) (eliminar dat (cdr li))))))
> (eliminar 'c '(a ((b) ((d c) a) c f)))
(a ((b) ((d) a) f))
> (eliminar '(1 2 3) '(a ((b) (((1 2 3) c) a) c f)))
(a ((b) ((c) a) c f))

Profundidad de una lista:
> (define (profundidad lista)
    (if (or (not (list? lista)) (null? lista)) 0
        (if (> (+ 1 (profundidad (car lista))) (profundidad (cdr lista)))
            (+ 1 (profundidad (car lista)))
            (profundidad (cdr lista)))))
> (profundidad '((2 3)(3 ((7))) 5))
4
[el valor esperado es 4]

"Planchado" de una lista:
> (define (planchar li)
    (cond
      ((null? li) '())
      ((list? (car li)) (append (planchar (car li)) (planchar (cdr li))))
      (else (cons (car li) (planchar (cdr li))))))
> (planchar '((2 3)(3 ((7))) 5))
(2 3 3 7 5)

Definicion de funciones para "ocultar" la recursividad en la programacion funcional
-----------------------------------------------------------------------------------

FILTRAR [selecciona de una lista los elementos que cumplan con una condicion dada]:
> (define (filtrar f l)
    (cond
      ((null? l) '())
      ((f (car l)) (cons (car l) (filtrar f (cdr l))))
      (else (filtrar f (cdr l)))))
> (filtrar (lambda (x) (> x 0)) '(5 0 2 -1 4 6 0 8))
(5 2 4 6 8)

REDUCIR [reduce una lista aplicando de a pares una funcion dada]:
> (define (reducir f l)
    (if (null? (cdr l))
        (car l)
        (f (car l) (reducir f (cdr l)))))
> (reducir (lambda (x y) (if (> x 0) (cons x y) y)) '(5 0 2 -1 4 6 0 8 ()))
(5 2 4 6 8)

MAPEAR [aplica a cada elemento de una lista una funcion dada]:
> (define (mapear op l)
    (if (null? l)
        '()
        (cons (op (car l)) (mapear op (cdr l)))))
> (mapear (lambda (x) (if (equal? x 0) 'z x)) '(5 0 2 -1 4 6 0 8))
(5 z 2 -1 4 6 z 8)

TRANSPONER [transpone una lista de listas]:
> (define (transponer m)
    (if (null? (car m))
        '()
        (cons (mapear car m) (transponer (mapear cdr m)))))
> (transponer '((a b c) (d e f) (g h i)))
((a d g) (b e h) (c f i))

IOTA [retorna una lista con los primeros n numeros naturales]:
> (define (iota n)
    (if (< n 1)
         '()
         (auxiota 1 n)))
> (define (auxiota i n)
    (if (equal? i n)
        (list n)
        (cons i (auxiota (+ i 1) n))))
> (iota 10)
(1 2 3 4 5 6 7 8 9 10)

Funciones implementadas usando las funciones anteriores
-------------------------------------------------------

Sumatoria de los primeros n numeros naturales:
> (define (sumatoria n) (reducir + (iota n)))
> (sumatoria 100)
5050
[El valor esperado es 5050]

Eliminacion de los elementos repetidos en una lista simple:
> (define (eliminar-repetidos li)
    (reverse (reducir (lambda (x y) (if (existe? x y) y (cons x y))) (reverse (cons '() li)))))
> (eliminar-repetidos '(a b c d e f g d c h b i j))
(a b c d e f g h i j)

Seleccion del enesimo elemento de una lista dada:
> (define (seleccionar n li)
    (if (or (< n 1) (> n (length li)))
        '()
        (car (car (filtrar (lambda (x) (equal? n (car (cdr x)))) (transponer (list li (iota (length li)))))))))
> (seleccionar 5 '(a b c d e f g h i j))
e

Aplicacion de todas las funciones de una lista a un elemento dado:
> (define (aplicar-todas lf x)
    (mapear (lambda (f) (f x)) lf))
> (aplicar-todas (list length cdr car) '((3 2 1)(9 8)(7 6)(5 4)))
(4 ((9 8) (7 6) (5 4)) (3 2 1))

Entrada de datos y salida del interprete
----------------------------------------

Carga de datos desde la terminal/consola:
> (define r 0)
> (define (cargar-r)
    (display "->r: ")(set! r (read))(display "r*2: ")(display (+ r r))(newline))
> (cargar-r)

Para ver el ambiente [no funciona en Racket v8.10]: (env)
Para salir del interprete: (exit)
